[
  {
    "title": "The Lord of the Rings",
    "author": "J.R.R. Tolkien",
    "google_books_id": "yl4dILkcqm4C",
    "score": 105.47664925007902,
    "description": "Immerse yourself in Middle-earth with J.R.R. Tolkien’s classic masterpieces behind the films... This special 50th anniversary edition includes three volumes of The Lord of the Rings (The Fellowship of the Ring, The Two Towers, and The Return of the King), along with an extensive new index—a must-own tome for old and new Tolkien readers alike. One Ring to rule them all, One Ring to find them, One Ring to bring them all and in the darkness bind them. In ancient times the Rings of Power were crafted by the Elven-smiths, and Sauron, the Dark Lord, forged the One Ring, filling it with his own power so that he could rule all others. But the One Ring was taken from him, and though he sought it throughout Middle-earth, it remained lost to him. After many ages it fell by chance into the hands of the hobbit Bilbo Baggins. From Sauron's fastness in the Dark Tower of Mordor, his power spread far and wide. Sauron gathered all the Great Rings to him, but always he searched for the One Ring that would complete his dominion. When Bilbo reached his eleventy-first birthday he disappeared, bequeathing to his young cousin Frodo the Ruling Ring and a perilous quest: to journey across Middle-earth, deep into the shadow of the Dark Lord, and destroy the Ring by casting it into the Cracks of Doom. The Lord of the Rings tells of the great quest undertaken by Frodo and the Fellowship of the Ring: Gandalf the Wizard; the hobbits Merry, Pippin, and Sam; Gimli the Dwarf; Legolas the Elf; Boromir of Gondor; and a tall, mysterious stranger called Strider. J.R.R. Tolkien (1892-1973), beloved throughout the world as the creator of The Hobbit, The Lord of the Rings, and The Silmarillion, was a professor of Anglo-Saxon at Oxford, a fellow of Pembroke College, and a fellow of Merton College until his retirement in 1959. His chief interest was the linguistic aspects of the early English written tradition, but while he studied classic works of the past, he was creating a set of his own.",
    "publishedDate": "2012-02-15",
    "pageCount": 1267,
    "publisher": "HarperCollins",
    "language": "en",
    "categories": [
      "Fiction"
    ],
    "averageRating": 4.5,
    "ratingsCount": 63,
    "cover_url": "https://books.google.com/books/content?id=yl4dILkcqm4C&printsec=frontcover&img=1",
    "image_size": "thumbnail",
    "processing_time": 0.63
  },
  {
    "title": "Sapiens: A Brief History of Humankind",
    "author": "Yuval Noah Harari",
    "google_books_id": "1EiJAwAAQBAJ",
    "score": 100.69484807238462,
    "description": "'Interesting and provocative... It gives you a sense of how briefly we've been on this Earth' Barack Obama What makes us brilliant? What makes us deadly? What makes us Sapiens? One of the world's preeminent historians and thinkers, Yuval Noah Harari challenges everything we know about being human. Earth is 4.5 billion years old. In just a fraction of that time, one species among countless others has conquered it: us. In this bold and provocative book, Yuval Noah Harari explores who we are, how we got here and where we're going. **ONE OF THE GUARDIAN'S 100 BEST BOOKS OF THE 21st CENTURY** PRAISE FOR SAPIENS: 'Jaw-dropping from the first word to the last... It may be the best book I've ever read' Chris Evans 'Startling... It changes the way you look at the world' Simon Mayo 'I would recommend Sapiens to anyone who's interested in the history and future of our species' Bill Gates Over 2 million copies sold since publication [Nielsen BookScan UK, Circana BookScan US, April 2024]",
    "publishedDate": "2014-09-04",
    "pageCount": 354,
    "publisher": "Random House",
    "language": "en",
    "categories": [
      "History"
    ],
    "averageRating": 4.5,
    "ratingsCount": 12,
    "cover_url": "https://books.google.com/books/content?id=1EiJAwAAQBAJ&printsec=frontcover&img=1",
    "image_size": "thumbnail",
    "processing_time": 0.53
  },
  {
    "title": "L'Étranger",
    "author": "Albert Camus",
    "google_books_id": "CAPYAAAAMAAJ",
    "score": 85.07944154167984,
    "description": "Caught in the grip of forces he does not understand, a quiet, ordinary clerk in Algiers commits a murder.",
    "publishedDate": "1988",
    "pageCount": 152,
    "publisher": "Knopf",
    "language": "en",
    "categories": [
      "Fiction"
    ],
    "averageRating": 5,
    "ratingsCount": 1,
    "cover_url": "https://books.google.com/books/content?id=CAPYAAAAMAAJ&printsec=frontcover&img=1",
    "image_size": "thumbnail",
    "processing_time": 0.56
  },
  {
    "title": "Harry Potter and the Philosopher's Stone",
    "author": "J.K. Rowling",
    "google_books_id": "O-gmvgAACAAJ",
    "score": 85.07944154167984,
    "description": "Gryffindor, Slytherin, Hufflepuff, Ravenclaw ... Twenty years ago these magical words and many more flowed from a young writer's pen, an orphan called Harry Potter was freed from the cupboard under the stairs - and a global phenomenon started. Harry Potter and the Philosopher's Stone has been read and loved by every new generation since. To mark the 20th anniversary of first publication, Bloomsbury has published four House Editions of J.K. Rowling's modern classic. These stunning editions each feature the individual house crest on the jacket and line illustrations exclusive to that house, by Kate Greenaway Medal winner Levi Pinfold. Exciting new extra content includes fact files and profiles of favourite characters, and each book has sprayed edges in the house colours. Available for a limited period only, these highly collectable editions are a must-have for all Harry Potter fans.",
    "publishedDate": "2017",
    "pageCount": 0,
    "publisher": "Bloomsbury Children's Books",
    "language": "en",
    "categories": [
      "Children's stories"
    ],
    "averageRating": 5,
    "ratingsCount": 1,
    "cover_url": "https://books.google.com/books/content?id=O-gmvgAACAAJ&printsec=frontcover&img=1",
    "image_size": "thumbnail",
    "processing_time": 0.51
  },
  {
    "title": "One Hundred Years of Solitude",
    "author": "Gabriel García Márquez",
    "google_books_id": "RyGVAgAAQBAJ",
    "score": 98.37527840768416,
    "description": "ONE OF THE WORLD'S MOST FAMOUS BOOKS AND WINNER OF THE NOBEL PRIZE FOR LITERATURE _______________________________ 'Many years later, as he faced the firing squad, Colonel Aureliano Buendía was to remember that distant afternoon when his father took him to discover ice' Gabriel García Márquez's great masterpiece is the story of seven generations of the Buendía family and of Macondo, the town they built. Though little more than a settlement surrounded by mountains, Macondo has its wars and disasters, even its wonders and its miracles. A microcosm of Columbian life, its secrets lie hidden, encoded in a book, and only Aureliano Buendía can fathom its mysteries and reveal its shrouded destiny. Blending political reality with magic realism, fantasy and comic invention, One Hundred Years of Solitude is one of the most daringly original works of the twentieth century. _______________________________ 'Should be required reading for the entire human race' The New York Times 'The book that sort of saved my life' Emma Thompson 'No lover of fiction can fail to respond to the grace of Márquez's writing' Sunday Telegraph",
    "publishedDate": "2014-03-06",
    "pageCount": 431,
    "publisher": "Penguin UK",
    "language": "en",
    "categories": [
      "Fiction"
    ],
    "averageRating": 4.5,
    "ratingsCount": 5,
    "cover_url": "https://books.google.com/books/content?id=RyGVAgAAQBAJ&printsec=frontcover&img=1",
    "image_size": "thumbnail",
    "processing_time": 0.65
  }
]